Revit 2027 API
IFCFileWriteOptions.FileName Property
 The full file name of the IFC file to be written.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FileName { get; set; }
Public Property FileName As String
	Get
	Set
public:
property String^ FileName {
	String^ get ();
	void set (String^ value);
}
member FileName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace